
const question=[
    {
        id: 1,
        title : "طراحی وب چیست؟",
        info : "طراحی وب (Web Design) فرایندی است که شامل ایجاد و نگهداری وب‌سایت‌ها می‌شود. این فرایند شامل جنبه‌های ظاهری (Front-end) و همچنین ساختار و عملکرد (Back-end) وب‌سایت است. به عبارت دیگر، طراحی وب به جنبه‌های بصری، تجربه کاربری (UX)، و رابط کاربری (UI) یک وب‌سایت می‌پردازد و اطمینان حاصل می‌کند که وب‌سایت به درستی کار کرده و برای کاربران جذاب باشد"
    },
    {
        id: 2,
        title : "فرانت اند چیست؟",
        info : "فرانت اند (Front-end) بخشی از یک وبسایت یا اپلیکیشن است که کاربر به طور مستقیم با آن تعامل دارد و آن را می‌بیند. این شامل تمام المان‌های بصری مانند متن، تصاویر، دکمه‌ها، منوها و غیره است که کاربر با آن‌ها در تعامل است و به کمک کدهای HTML، CSS و JavaScript در مرورگر نمایش داده می‌شوند [1، 2]. به عبارت دیگر، فرانت اند مسئولیت ایجاد و مدیریت ظاهر و رابط کاربری یک وب‌سایت یا اپلیکیشن را بر عهده دارد و به کاربر امکان می‌دهد تا با بخش‌های مختلف آن تعامل برقرار کند. "
    },
    {
        id: 3,
        title : " بک اند چیست؟",
        info : "بک اند، به بخشی از یک وب سایت یا نرم افزار می‌گویند که برای کاربران قابل مشاهده نیست. به عبارتی دیگر هسته و مغز یک سایت است که وظیفه کنترل منطق آن را بر عهده دارد. سایت‌های دینامیک به برنامه نویس بک اند نیاز دارند تا منطق سایت را به وسیله زبان‌های برنامه نویسی پیاده‌سازی کنند."
    },

]
 
export default question;